scripts/performance/artillery-test.yml
# Artillery Load Testing Configuration for PaveMaster Suite
config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:8080' }}"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Steady state"
    - duration: 60
      arrivalRate: 20
      name: "Peak load"
  defaults:
    headers:
      User-Agent: "Artillery Load Test"
  processor: "./artillery-processor.js"

scenarios:
  - name: "User Journey"
    weight: 80
    flow:
      - get:
          url: "/"
          capture:
            - header: "set-cookie"
              as: "sessionCookie"
      - think: 2
      - get:
          url: "/auth"
          headers:
            cookie: "{{ sessionCookie }}"
      - think: 3
      - get:
          url: "/projects"
          headers:
            cookie: "{{ sessionCookie }}"
      - think: 2
      - get:
          url: "/equipment"
          headers:
            cookie: "{{ sessionCookie }}"
      - think: 2
      - get:
          url: "/fleet"
          headers:
            cookie: "{{ sessionCookie }}"
      - think: 2
      - get:
          url: "/employees"
          headers:
            cookie: "{{ sessionCookie }}"

  - name: "API Endpoints"
    weight: 20
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: [200, 404]
      - think: 1
      - get:
          url: "/api/status"
          expect:
            - statusCode: [200, 404]

expectations:
  - http.response_time.p99: 1000
  - http.response_time.p95: 500
  - http.response_time.median: 200
  - http.codes.200: 80
  - http.codes.302: 15